[
    {
      "id": "1",
      "title": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "cover": "/covers/harry-potter.jpg",
      "shortDescription": "A young wizard discovers his magical heritage.",
      "fullDescription": "Harry discovers on his 11th birthday that he is a wizard and attends Hogwarts. He makes friends, faces challenges, and learns about the dark wizard who once tried to kill him."
    },
    {
      "id": "2",
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "cover": "/covers/the-hobbit.jpg",
      "shortDescription": "A hobbit embarks on an unexpected adventure.",
      "fullDescription": "Bilbo Baggins is swept into a grand quest with a group of dwarves to reclaim their homeland from the dragon Smaug. Along the way, Bilbo proves far braver than he believes himself to be."
    },
    {
      "id": "3",
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "cover": "/covers/pride-and-prejudice.jpg",
      "shortDescription": "A story of love, manners, and misunderstanding.",
      "fullDescription": "Elizabeth Bennet must deal with matters of upbringing, morality, and marriage. Her clashes with Mr. Darcy reveal truths about pride, prejudice, and the nature of true love."
    },
    {
      "id": "4",
      "title": "1984",
      "author": "George Orwell",
      "cover": "/covers/1984.jpg",
      "shortDescription": "A dystopian society under constant surveillance.",
      "fullDescription": "Winston Smith lives in a totalitarian state controlled by Big Brother. As he begins to rebel, he learns the horrifying extent of the regime’s power and its manipulation of truth and reality."
    },
    {
      "id": "5",
      "title": "Around the World in 80 Days",
      "author": "Jules Verne",
      "cover": "/covers/around-the-world.jpg",
      "shortDescription": "An epic race across the globe.",
      "fullDescription": "Phileas Fogg accepts a bet to circumnavigate the globe in just 80 days. He and his loyal servant Passepartout face countless adventures in their race against time."
    },
    {
      "id": "6",
      "title": "Jane Eyre",
      "author": "Charlotte Brontë",
      "cover": "/covers/jane-eyre.jpg",
      "shortDescription": "A tale of passion and independence.",
      "fullDescription": "Orphaned Jane Eyre becomes a governess and falls in love with her employer, Mr. Rochester. Secrets from his past test her strength, morality, and resilience."
    },
    {
      "id": "7",
      "title": "The Little Prince",
      "author": "Antoine de Saint-Exupéry",
      "cover": "/covers/little-prince.jpg",
      "shortDescription": "A poetic tale of innocence and love.",
      "fullDescription": "A pilot stranded in the desert meets a young prince from another planet. Through their conversations, he learns lessons about childhood, love, and what truly matters."
    },
    {
      "id": "8",
      "title": "Of Human Bondage",
      "author": "W. Somerset Maugham",
      "cover": "/covers/of-human-bondage.jpg",
      "shortDescription": "A deep study of human emotion and self-discovery.",
      "fullDescription": "Philip Carey seeks meaning in his life through relationships, art, and travel. His journey is one of internal conflict, personal struggle, and the quest for purpose."
    },
    {
      "id": "9",
      "title": "White Fang",
      "author": "Jack London",
      "cover": "/covers/white-fang.jpg",
      "shortDescription": "A wild wolf-dog's journey to trust humans.",
      "fullDescription": "Born in the wild, White Fang must learn to survive both nature and man. His eventual bond with a kind owner shows the power of trust and compassion."
    }
  ]